pegasus/test/wetest/wsman/Create/Create_Success01rspgood.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xml="http://www.w3.org/XML/1998/namespace" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmb="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:wscim="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2">
<SOAP-ENV:Header>
<wsa:To>
http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
</wsa:To>
<wsa:Action>
http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse
</wsa:Action>
<wsa:MessageID>
uuid:00000000-0000-0000-0000-000000000000
</wsa:MessageID>
<wsa:RelatesTo>
uuid:00000000-0000-0000-0003-000000000001
</wsa:RelatesTo>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<wxf:ResourceCreated>
<wsa:Address>
http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
</wsa:Address>
<wsa:ReferenceParameters>
<wsman:ResourceURI>
http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/PG_TestPropertyTypes
</wsman:ResourceURI>
<wsman:SelectorSet>
<wsman:Selector Name="__cimnamespace">
test/static
</wsman:Selector>
<wsman:Selector Name="CreationClassName">
PG_TestPropertyTypes
</wsman:Selector>
<wsman:Selector Name="InstanceId">
1
</wsman:Selector>
</wsman:SelectorSet>
</wsa:ReferenceParameters>
</wxf:ResourceCreated>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
